Model: "model"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_1 (InputLayer)        [(None, 8, 8)]               0         []                            
                                                                                                  
 reshape (Reshape)           (None, 8, 8, 1)              0         ['input_1[0][0]']             
                                                                                                  
 conv2d (Conv2D)             (None, 8, 8, 512)            4608      ['reshape[0][0]']             
                                                                                                  
 batch_normalization (Batch  (None, 8, 8, 512)            2048      ['conv2d[0][0]']              
 Normalization)                                                                                   
                                                                                                  
 activation (Activation)     (None, 8, 8, 512)            0         ['batch_normalization[0][0]'] 
                                                                                                  
 conv2d_1 (Conv2D)           (None, 8, 8, 512)            2359296   ['activation[0][0]']          
                                                                                                  
 batch_normalization_1 (Bat  (None, 8, 8, 512)            2048      ['conv2d_1[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_1 (Activation)   (None, 8, 8, 512)            0         ['batch_normalization_1[0][0]'
                                                                    ]                             
                                                                                                  
 conv2d_2 (Conv2D)           (None, 6, 6, 512)            2359296   ['activation_1[0][0]']        
                                                                                                  
 batch_normalization_2 (Bat  (None, 6, 6, 512)            2048      ['conv2d_2[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_2 (Activation)   (None, 6, 6, 512)            0         ['batch_normalization_2[0][0]'
                                                                    ]                             
                                                                                                  
 conv2d_3 (Conv2D)           (None, 4, 4, 512)            2359296   ['activation_2[0][0]']        
                                                                                                  
 batch_normalization_3 (Bat  (None, 4, 4, 512)            2048      ['conv2d_3[0][0]']            
 chNormalization)                                                                                 
                                                                                                  
 activation_3 (Activation)   (None, 4, 4, 512)            0         ['batch_normalization_3[0][0]'
                                                                    ]                             
                                                                                                  
 flatten (Flatten)           (None, 8192)                 0         ['activation_3[0][0]']        
                                                                                                  
 dense (Dense)               (None, 1024)                 8388608   ['flatten[0][0]']             
                                                                                                  
 batch_normalization_4 (Bat  (None, 1024)                 4096      ['dense[0][0]']               
 chNormalization)                                                                                 
                                                                                                  
 activation_4 (Activation)   (None, 1024)                 0         ['batch_normalization_4[0][0]'
                                                                    ]                             
                                                                                                  
 dropout (Dropout)           (None, 1024)                 0         ['activation_4[0][0]']        
                                                                                                  
 dense_1 (Dense)             (None, 512)                  524288    ['dropout[0][0]']             
                                                                                                  
 batch_normalization_5 (Bat  (None, 512)                  2048      ['dense_1[0][0]']             
 chNormalization)                                                                                 
                                                                                                  
 activation_5 (Activation)   (None, 512)                  0         ['batch_normalization_5[0][0]'
                                                                    ]                             
                                                                                                  
 dropout_1 (Dropout)         (None, 512)                  0         ['activation_5[0][0]']        
                                                                                                  
 pi (Dense)                  (None, 4097)                 2101761   ['dropout_1[0][0]']           
                                                                                                  
 v (Dense)                   (None, 1)                    513       ['dropout_1[0][0]']           
                                                                                                  
==================================================================================================
Total params: 18112002 (69.09 MB)
Trainable params: 18104834 (69.06 MB)
Non-trainable params: 7168 (28.00 KB)
__________________________________________________________________________________________________
