Model: "model_2"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_3 (InputLayer)        [(None, 8, 8)]               0         []                            
                                                                                                  
 reshape_2 (Reshape)         (None, 8, 8, 1)              0         ['input_3[0][0]']             
                                                                                                  
 conv2d_8 (Conv2D)           (None, 8, 8, 512)            4608      ['reshape_2[0][0]']           
                                                                                                  
 batch_normalization_12 (Ba  (None, 8, 8, 512)            2048      ['conv2d_8[0][0]']            
 tchNormalization)                                                                                
                                                                                                  
 activation_12 (Activation)  (None, 8, 8, 512)            0         ['batch_normalization_12[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_9 (Conv2D)           (None, 8, 8, 512)            2359296   ['activation_12[0][0]']       
                                                                                                  
 batch_normalization_13 (Ba  (None, 8, 8, 512)            2048      ['conv2d_9[0][0]']            
 tchNormalization)                                                                                
                                                                                                  
 activation_13 (Activation)  (None, 8, 8, 512)            0         ['batch_normalization_13[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_10 (Conv2D)          (None, 6, 6, 512)            2359296   ['activation_13[0][0]']       
                                                                                                  
 batch_normalization_14 (Ba  (None, 6, 6, 512)            2048      ['conv2d_10[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_14 (Activation)  (None, 6, 6, 512)            0         ['batch_normalization_14[0][0]
                                                                    ']                            
                                                                                                  
 conv2d_11 (Conv2D)          (None, 4, 4, 512)            2359296   ['activation_14[0][0]']       
                                                                                                  
 batch_normalization_15 (Ba  (None, 4, 4, 512)            2048      ['conv2d_11[0][0]']           
 tchNormalization)                                                                                
                                                                                                  
 activation_15 (Activation)  (None, 4, 4, 512)            0         ['batch_normalization_15[0][0]
                                                                    ']                            
                                                                                                  
 flatten_2 (Flatten)         (None, 8192)                 0         ['activation_15[0][0]']       
                                                                                                  
 dense_4 (Dense)             (None, 1024)                 8388608   ['flatten_2[0][0]']           
                                                                                                  
 batch_normalization_16 (Ba  (None, 1024)                 4096      ['dense_4[0][0]']             
 tchNormalization)                                                                                
                                                                                                  
 activation_16 (Activation)  (None, 1024)                 0         ['batch_normalization_16[0][0]
                                                                    ']                            
                                                                                                  
 dropout_4 (Dropout)         (None, 1024)                 0         ['activation_16[0][0]']       
                                                                                                  
 dense_5 (Dense)             (None, 512)                  524288    ['dropout_4[0][0]']           
                                                                                                  
 batch_normalization_17 (Ba  (None, 512)                  2048      ['dense_5[0][0]']             
 tchNormalization)                                                                                
                                                                                                  
 activation_17 (Activation)  (None, 512)                  0         ['batch_normalization_17[0][0]
                                                                    ']                            
                                                                                                  
 dropout_5 (Dropout)         (None, 512)                  0         ['activation_17[0][0]']       
                                                                                                  
 pi (Dense)                  (None, 4097)                 2101761   ['dropout_5[0][0]']           
                                                                                                  
 v (Dense)                   (None, 1)                    513       ['dropout_5[0][0]']           
                                                                                                  
==================================================================================================
Total params: 18112002 (69.09 MB)
Trainable params: 18104834 (69.06 MB)
Non-trainable params: 7168 (28.00 KB)
__________________________________________________________________________________________________
